{"docs": [{"text": "Has most of everything one would want in a E-reader tablet. As an older Kindle user this upgrade works so much better.", "metadata": [{"name": "date", "type": "date", "value": "2012-12-14T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 4}], "title": "New Fire"}, {"text": "This should be a 4 1/2 star review. I couldn't figure out how to change it after I submitted it. I have to admit that when I first turned it on to try it out I didn't think I would keep it. I loved my Fire first generation and it took me awhile to see what made it worth paying for the upgrade. After downloading my apps, music, photos, playing some games, etc. I am very pleased with my purchase. Touch to speech on the reader is a good feature, xray features for movies and books is awesome and photos of artists in my music library is a special treat. Some of the issues I read about in other reviews about special offers being an aggravation are practically a non issue. The product offers on the home screen can be hidden by changing the home screen viewing option in settings. I am still getting familiar with the features and every time I use it (which is often, I think I'm getting addicted to it), I find more things I love. Love the Bluetooth, love the HD screen, love that it is thinner than the first Fire. So far the only thing I don't love is not being able to choose what goes onto the carousel. Things keep popping up. It' s not anything that would make me return it though. I have added the apps I use most to my favorites and don't really use the carousel very much anyway. I owned a Galaxy Tab 2 but sold it to buy a Fire. You just can't beat the Fire for simplicity and convenience if you use Amazon books, music, etc. Love this tablet.", "metadata": [{"name": "date", "type": "date", "value": "2012-12-07T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 3}], "title": "Upgraded to Fire HD"}, {"text": "This product was delivered quickly and was exactly what I was expecting for a great price. It was the perfect item for a gift.", "metadata": [{"name": "date", "type": "date", "value": "2013-01-01T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Great"}, {"text": "This was a Christmas gift for daughter-in-law and she simply loves it. She even brings it to the dinner table.", "metadata": [{"name": "date", "type": "date", "value": "2013-02-18T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Christmas gift"}, {"text": "for the money, this product is extremely good. The Apps are too expensive though. It's quick and competant but not as many free apps as I'm used to.", "metadata": [{"name": "date", "type": "date", "value": "2012-10-29T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Excellent piece of equipment"}, {"text": "I love a lot of things about the Fire HD, but I'm still debating whether I should've gone with an iPad.\nPro' s:\nThe picture is awesome, especially with hd movies. Perfectly Crystal clear.\nThe sound is also awesome. It's incredibly loud and amazes me that it never .\nMy biggest pro (especially over Apple/iTunes) is once you purchase your media, it can be shared with any compatible device. I can put it on my phone, iPod, laptop and even with my smart tv. You can't do that with movies purchased in iTunes unless it's an I- product. So for me that was a huge plus.\nTheir selection of movies, books, apps, etc is great too. I haven't searched for something yet and not found it.\nIt's definitely user friendly and moving things between the device and the cloud or even other devices is incredibly easy.\n\nAs for the cons:\nIt's completely uncustomizable. Sure, you can pay an additional 15 flipping dollars to get rid of the advertisements on the unlock screen (to me is not worth it and I refuse) and pick from a few wallpapers there, but that's it. You can't rearrange the carousel, add a background, nothing.\nThe cost is okay, but after having purchased the 32 gig, the wall charger, the no advertisements fee, etc, you're not that far from being able to get an iPad mini, with a bigger screen and customizable.\nMy biggest complaint is that it includes some features that just flat out do not work. Such as the screen auto adjusting the brightness. It seems minor, but if you are paying for it, it should work. It also tends to have moments of automatically scrolling to the top of a webpage which is frustrating. Amazon had decided I just had a defective device so they replaced it. It still does the same things and after some Google searching I found that this is common and is just not compatible with the device. Like I said, it's really nothing major and it still functions, but I'm tired of paying for things and only 80 percent of it working. If that's the case, I should only have to pay for what DOES function correctly.\nIt also will not run flash player, so you will not be able to view some webpages or do anything that needs it. Also, not a big deal, but can be aggravating.\n\nI could probably think of more wrong with it, but that covers how I feel about it so far. I guess you just have to figure out if you're as easily irritated by some of those things as I am or not. I will probably end up keeping this, if for anything it'd be the media sharing....and that it runs on android...so you can get angry birds for free.\n\nUpdate: after having written this I read some of the other reviews of this and I feel like some things should be explained. First of all, those reviews seem...paid for. Enough said. Also, the reason that 15 dollar advertisement mess is so frustrating for me and other purchasers is because we already bought the thing and are shopping with Amazon. We shouldn't have to put up with that. As far as some of those \"reviewers\" saying it is to make up for the cost if the Kindle, no. They wouldn't be selling it at the price they do if they weren't making a good profit. With my kindle alone Amazon has already gotten over $350 from me, so I'd have to say they aren't subsidizing anything. For the extra 15 dollars to not have to see the advertisements, I could return everything and get an IPad and not have to deal with it. Period.", "metadata": [{"name": "date", "type": "date", "value": "2013-03-09T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 3}], "title": "Love it and don't.."}, {"text": "I purchased the Kindle Fire HD 7\" for the sole purpose of reading and playing a couple of games. I love the size and weight of the Kindle and love the screen. We decided to try the kindle free unlimited for my 5 year old daughter and she enjoys the videos and games. I love that I can control how much she uses the app and that I don't have to worry as much about what she is getting into. I am a prime member, so I get the free books and also rent books on the Kindle from our local library. I am extremely happy with my purchase and recommend it to those that are looking for a simple device to read on and play games.", "metadata": [{"name": "date", "type": "date", "value": "2013-01-09T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Everything is great and it works well"}, {"text": "This is a great all around tablet that does everything aI want plus some. Also you cannot beat the price", "metadata": [{"name": "date", "type": "date", "value": "2013-03-16T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Great tablet"}, {"text": "We gave these to two of our children. Super cool and it does more than I expected.\nThese are way Cool!", "metadata": [{"name": "date", "type": "date", "value": "2013-01-02T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Kindle fire"}, {"text": "So received mine the other day, pretty nice product for the price point; easy to use out of the box, seemingly solid construction. I have no complaint with the ads, I realize at the low price point they have to recoup costs somehow. My issue is that the charger included is completely useless. You cannot use the kindle in any manner while \"charging\" or it will not charge. Further, even if in sleep mode it seems to take several hours to charge fully. They may as well have not included this as a charger. I have already caved and bought the \"fast charger\" or whatever they're calling it. When looking at the product it was in no way made clear how completely inadequate the charger included is, I'm guessing Amazon is just counting on everyone being so frustrated with the included charger that they have to buy the upgrade. I realize it's only $20 for the new charger, but it is ridiculous to sell a product that is essentially useless unless you buy another upgrade. I wish Amazon would not have resorted to these used car dealer tactics of after the fact add-ons, just give me the real price of the product. Also the app store is absolute garbage, tons of popular and useful apps missing.\nUpdate-11/21/12\nPersistently problems with viewing any sort of videos, apps are glitchy, internet is unsatisfactory. Even when I use mobile versions of websites there are repeatedly issues with video. I would recommend going with another tablet. The lack of apps and non-access to google play is insane and frustrating.", "metadata": [{"name": "date", "type": "date", "value": "2012-11-10T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 1}], "title": "Nickel and Dimed, Many missing apps, constant issues w/ video"}, {"text": "i have bought the Kindle fire 7 as a gift for my father to play his games but i have fell in love with it while i am setting up everything before i deliver it to my father: installing all the apps, photos and home videos, i did have hard time converting the videos i have to a format that would play on the kindle though, i got a trojan.dropper when i had to download a software to convert the videos to MP4, i wish Amazon would have a software to manage Kindle like Apple has Itunes and also i did not know where to find the videos once i transferred them to the Kindle, but i found the app \"Personal Videos\" on the Kindle after doing some searching over the Internet.", "metadata": [{"name": "date", "type": "date", "value": "2013-01-21T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 4}], "title": "First tablet..."}, {"text": "My wife loves it! She did the whole setup. Setup her own WiFi and all. Amazon wants five more words.", "metadata": [{"name": "date", "type": "date", "value": "2013-01-07T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "No complaints."}, {"text": "In our family, this is the second Kindle.\nKindle, I chose four candidates:\n- Kindle HD\n- Google Nexus 7\n- Samsung Galaxy Tab 2 7.0\n- NOOK HD", "metadata": [{"name": "date", "type": "date", "value": "2012-12-15T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "A very good tablet."}, {"text": "This has been one of the best purchases I've made in years. I wanted something to function as an e-reader. But when I saw this item I just had to have it. I've streamed some tv shows on it, read books on it and even messed around with some games and music. The sound quality and picture are amazing for such a small device. I do recommend getting a carrying case for it.", "metadata": [{"name": "date", "type": "date", "value": "2012-12-10T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Love my Kindle!"}, {"text": "", "metadata": [{"name": "date", "type": "date", "value": "2013-01-08T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Love it."}, {"text": "I love my kindle fire hd. Thinking about getting next size up and giving this to my grand daughter. I am very pleased with the colors.", "metadata": [{"name": "date", "type": "date", "value": "2013-02-17T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "I can't get any work done."}, {"text": "I have fun with my kindle and I love that it have a camera so i can skype on it too.", "metadata": [{"name": "date", "type": "date", "value": "2013-01-07T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "I love it"}, {"text": "This device is holding Canadian users hostage ! We received it, and can only use 2 of the many functions (books and web). No apps, music, sound, or movies are available... What a joke!\nFree trade exists between our 2 countries, but Amazon can't even make a tablet that works in both countries !!\nGoing to replace it with the Ipad... no problems there !!\nHope Amazon gets in the game soon... they just don't get it that Canada is a viable market...", "metadata": [{"name": "date", "type": "date", "value": "2013-01-02T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 2}], "title": "Only partially functional in Canada"}, {"text": "This was a Christmas gift for my wife.She says its fantastic and is learning new things everyday.She is very satisfied.", "metadata": [{"name": "date", "type": "date", "value": "2013-01-09T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Kindle Fire HD"}, {"text": "I bought the kindle HD for my little cousin as a Xmas gift and she loves it and enjoys it everyday.", "metadata": [{"name": "date", "type": "date", "value": "2013-01-13T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "great!!!"}, {"text": "", "metadata": [{"name": "date", "type": "date", "value": "2012-10-30T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 1}], "title": "Liked KindleFire I better."}, {"text": "I live in a small town with no book store, no movie theater, no movie rental services. So until I got my Kindle Fire HD I was relying on Amazon to get books and movies anyway. The Kindle Fire HD has made it so easy for me to enjoy books and movies and tv shows instantly. I read constantly and the ability to have books instantly at my finger tips with out having to drive 45 miles to find a book store is simply amazing to me. If you want something strictly for entertainment this device is the way to go. Speakers are amazing and I just love being able to get up and go get a drink with out pausing a movie. What really amazed me and was completely unexpected was the fact that an album I purchased on Amazon months before was already on my device when I got it. This device is amazing magic and I love it.", "metadata": [{"name": "date", "type": "date", "value": "2013-03-06T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "GREAT MEDIA CONSUMPTION DEVICE"}, {"text": "This is one of the best investments I have ever made! Resisted buying one because I have a laptop and iphone, but now that I have it, I find myself using the Kindle more than either of the others...plus it is an awesome way to carry books, magazines, etc with me without all the bulk. It is also a great teaching tool for my granddaughter with all the educational apps available (she also loves the games) and I am seriously considering giving this as a gift for her next birthday. I highly recommend the Kindle Fire HD!!", "metadata": [{"name": "date", "type": "date", "value": "2013-04-02T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Love my Kindle Fire HD"}, {"text": "For a smaller tablet it offers everything it's larger counterpart offers. A good buy if u use it for everyday use", "metadata": [{"name": "date", "type": "date", "value": "2013-04-02T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Great little tablet"}, {"text": "We bought the original Kindle fire when it came out last year. Definitely have enjoyed it and both my wife and myself have begun to use our Prime memberships quite a bit ( Amazon is starting to get some great movie content recently that makes the Prime membership worth it in my opinion ).\n\nFor those on the fence if it's worth the upgrade let me mention one thing that I love about the new HD. As an owner and user of an Apple IPhone 4S I've always noticed that the touch screen on the IPhone is very responsive to your fingers and relatively glitch free. When I would pick up my 1st generation Fire I would always notice that it wasn't quite as responsive as the Apple touch screen. I would actually use some apps on my phone rather than the older Fire just for this reason.\n\nWell it seems that the new Fire HD has a much more responsive screen and I now find it equal to the responsiveness of Apple touch screen products for what it's worth. Amazon seems to have upgraded their touch screen technology and the glitchiness of the previous Fire seems to be gone.\n\nAlso, the new HD screen is much brighter, clearer and in general just looks great. Movies look fantastic. Watched \" The Midnight Cowboy \" last night in bed ( free with Prime membership by the way ) and it looked and sounded great. Streaming is much, much quicker on the Fire HD ( and I already thought it was pretty good on the 1st generation fire ). The movie started right away, quicker than if I had popped a DVD in my player. The new speakers are a huge improvement. Also looking forward to getting an HDMI cable and showing Prime movies on my 55\" LG HD TV ! That will be really something I think.\n\nWell worth the upgrade in my opinion and great job Amazon !", "metadata": [{"name": "date", "type": "date", "value": "2012-09-19T00:00:00.000Z"}, {"name": "rating", "type": "score", "value": 5}], "title": "Wife and I just upgraded to the Fire HD"}]}